# Import most important libraries

In [1]:
import numpy as np
import pandas as pd

# Read The Dataset

In [2]:
data = pd.read_csv("D:\college\سنة رابعة\ML\Assignments\Assignment 1\customer_data.csv")
df = data.copy()

# Inspect The Data

In [3]:
# Show The Head of rows in the data 
df.head()

   age  salary  purchased
0   44   39000          0
1   32  120000          1
2   38   50000          0
3   32  135000          1
4   52   21000          1

In [4]:
# Summary Statistics
df.describe()

              age         salary   purchased
count  400.000000     400.000000  400.000000
mean    37.655000   69742.500000    0.357500
std     10.482877   34096.960282    0.479864
min     18.000000   15000.000000    0.000000
25%     29.750000   43000.000000    0.000000
50%     37.000000   70000.000000    0.000000
75%     46.000000   88000.000000    1.000000
max     60.000000  150000.000000    1.000000

In [5]:
# Information about columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        400 non-null    int64
 1   salary     400 non-null    int64
 2   purchased  400 non-null    int64
dtypes: int64(3)
memory usage: 9.5 KB

In [6]:
# Discover Null Values
df.isnull().sum()

age          0
salary       0
purchased    0
dtype: int64

In [7]:
# show columns names
df.columns

Index(['age', 'salary', 'purchased'], dtype='object')

# Standered scaler

In [8]:
df["age"] = (df["age"] - np.mean(df["age"]))/np.std(df["age"])
df["salary"] = (df["salary"] - np.mean(df["salary"]))/np.std(df["salary"])

In [9]:
df.head()

        age    salary  purchased
0  0.606031 -0.902749          0
1 -0.540127  1.475804          1
2  0.032952 -0.579736          0
3 -0.540127  1.916277          1
4  1.370136 -1.431317          1

# Modeling

#### Trian test split

In [10]:
x = df[['age', 'salary']].values
y = df["purchased"].values

In [11]:
x_train = x[:300]
x_test = x[300:400]
y_train = y[:300]
y_test = y[300:400]

In [12]:
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(300, 2)
(100, 2)
(300,)
(100,)

# Class Logistic Regression

In [13]:
# LogisticRegression class
n_samples = x_train.shape[0]
n_features = x_train.shape[1]

def sigmoid(x):
    return 1/(1+np.exp(-x))
def accuracy(y_pred,y_test):
        return np.sum(y_pred==y_test)/len(y_test)

class LogisticRegression:
    def __init__(self,lr=0.01,n_iter=1000):
        self.lr = lr
        self.n_iter = n_iter
        self.weights = None
        self.bias = None
        
        
    def fit(self,x_train,y_train):
        self.weights = np.zeros(n_features) 
        self.bias = 0  
        
        for _ in range(self.n_iter):
            linear_pred = np.dot(x_train, self.weights) + self.bias
            predictions = sigmoid(linear_pred)

            dw = (1/n_samples) * np.dot(x_train.T, (predictions - y_train))
            db = (1/n_samples) * np.sum(predictions-y_train)

            self.weights = self.weights - self.lr*dw
            self.bias = self.bias - self.lr*db

        
    def predict(self,x_test):
        linear_predictions = x_test.dot(self.weights)+self.bias
        y_predictions = sigmoid(linear_predictions)
        class_predictions = [0 if y<=0.5 else 1 for y in y_predictions]
        return class_predictions

In [14]:
Model = LogisticRegression(lr=0.3)
Model.fit(x_train,y_train)
y_pred = Model.predict(x_test)
acc = accuracy(y_pred,y_test)*100
print("Logistic Regression accuracy:",acc,"%")

Logistic Regression accuracy: 89.0 %

In [15]:
pred_actual = [y_pred,y_test]
output = pd.DataFrame(pred_actual,["y_pred","y_test"]).T
output[-10:-1]

    y_pred  y_test
90       0       0
91       1       1
92       0       0
93       0       0
94       0       0
95       0       1
96       0       0
97       0       1
98       1       1

In [16]:
test_case = np.array([40,50000]).reshape(1,2)
answer = Model.predict(test_case)
answer[0]

1

In [17]:
print("Bais: ",Model.bias)
print("W1: ",Model.weights[0])
print("W2: ",Model.weights[1])

Bais:  -1.103564656871984
W1:  2.35006377252724
W2:  1.19800332405797

In [18]:
Age = input("Age: ")
Age = pd.to_numeric(Age)

Age: 50

In [19]:
salary = input("Salary")
salary = pd.to_numeric(salary)

Salary25000

In [24]:
optimized_hypothesis_function = Model.weights[0]*Age + Model.weights[1]*salary + Model.bias
if(optimized_hypothesis_function>=0.5):
    print(1)
else:
    print(0)

1

# End